tigercosmos/bus-iot/station/MDK/Boards/ST/STM32F429I-Discovery/emWin/Example/RTE/Graphics_Display/STM32F429ZITx/LCDConf.c
  if (LayerIndex >= GUI_NUM_LAYERS) {
    return;
  }
  if (Initialized == 0) {
    //
    // Configure the LCD pins and clocking
    //
    LCD_X_Init();
    _InitIL9341();
    //
    // Clock configuration
    //
    __LTDC_CLK_ENABLE();  // Enable LTDC Clock
    __DMA2D_CLK_ENABLE(); // Enable DMA2D Clock
    //
    // LTDC configuration
    LTDC_Handle.Instance = LTDC;
    //
    //
    // Polarity configuration
    //
    LTDC_Handle.Init.HSPolarity = LTDC_HSPOLARITY_AL;  // Horizontal synchronization polarity as active low
    LTDC_Handle.Init.VSPolarity = LTDC_VSPOLARITY_AL;  // Vertical synchronization polarity as active low
    LTDC_Handle.Init.DEPolarity = LTDC_DEPOLARITY_AL;  // Data enable polarity as active low
    LTDC_Handle.Init.PCPolarity = LTDC_PCPOLARITY_IPC; // Pixel clock polarity as input pixel clock
    //
    // Configure R,G,B component values for LCD background color
    //
    LTDC_Handle.Init.Backcolor.Red   = (BK_COLOR >>  0) & 0xFF;
    LTDC_Handle.Init.Backcolor.Green = (BK_COLOR >>  8) & 0xFF;
    LTDC_Handle.Init.Backcolor.Blue  = (BK_COLOR >> 16) & 0xFF;
    //
    // Timing configuration
    //
    LTDC_Handle.Init.HorizontalSync     = HSW;                    // Horizontal synchronization width
    LTDC_Handle.Init.VerticalSync       = VSW;                    // Vertical synchronization height
    LTDC_Handle.Init.AccumulatedHBP     = HBP;                    // Accumulated horizontal back porch
    LTDC_Handle.Init.AccumulatedVBP     = VBP;                    // Accumulated vertical back porch
    LTDC_Handle.Init.AccumulatedActiveW = HBP + XSIZE_PHYS;       // Accumulated active width
    LTDC_Handle.Init.AccumulatedActiveH = VBP + YSIZE_PHYS;       // Accumulated active height
    LTDC_Handle.Init.TotalWidth         = HBP + XSIZE_PHYS + HFP; // Total width
    LTDC_Handle.Init.TotalHeigh         = VBP + YSIZE_PHYS + VFP; // Total height
    //
    // Initialize LTDC
    HAL_LTDC_Init(&LTDC_Handle); 
    HAL_LTDC_ProgramLineEvent(&LTDC_Handle, 0);
    //
    // Enable LTDC interrupt
    //
    HAL_NVIC_EnableIRQ(LTDC_IRQn);
    //
    // DMA2D configuration
    //
    DMA2D_Handle.Instance = DMA2D;
    //
    // Enable DMA2D interrupt
    //
    __HAL_DMA2D_ENABLE_IT(&DMA2D_Handle, DMA2D_IT_TC);
    HAL_NVIC_EnableIRQ(DMA2D_IRQn);

    Initialized = 1;
  }
  //
  // Layer configuration
  //
  if (LCD_GetSwapXYEx(LayerIndex)) {
    xSize = LCD_GetYSizeEx(LayerIndex);
    ySize = LCD_GetXSizeEx(LayerIndex);
  } else {
    xSize = LCD_GetXSizeEx(LayerIndex);
    ySize = LCD_GetYSizeEx(LayerIndex);
  }
  //
  // Windowing configuration
  //
  LayerCfg.WindowX0    = 0;
  LayerCfg.WindowX1    = xSize;
  LayerCfg.WindowY0    = 0;
  LayerCfg.WindowY1    = ySize;
  LayerCfg.ImageWidth  = xSize;
  LayerCfg.ImageHeight = ySize;
  //
  // Pixel Format configuration
  //
  LayerCfg.PixelFormat = _GetPixelformat(LayerIndex);
  //
  // Alpha constant (255 totally opaque)
  //
  LayerCfg.Alpha  = 255;
  LayerCfg.Alpha0 = 0;
  //
  // Back Color configuration
  //
  LayerCfg.Backcolor.Blue  = 0;
  LayerCfg.Backcolor.Green = 0;
  LayerCfg.Backcolor.Red   = 0;
  //
  // Configure blending factors
  //
  LayerCfg.BlendingFactor1 = LTDC_BLENDING_FACTOR1_PAxCA;
  LayerCfg.BlendingFactor2 = LTDC_BLENDING_FACTOR2_PAxCA;
  //
  // Input Address configuration
  //
  LayerCfg.FBStartAdress = _aAddr[LayerIndex];
  //
  // Configure Layer
  //
  HAL_LTDC_ConfigLayer(&LTDC_Handle, &LayerCfg, LayerIndex);
  //
  // Enable LUT on demand
  //
  BitsPerPixel = LCD_GetBitsPerPixelEx(LayerIndex);
  if (BitsPerPixel <= 8) {
    //
    // Enable usage of LUT for all modes with <= 8bpp
    //
    HAL_LTDC_EnableCLUT(&LTDC_Handle, LayerIndex);
  } else {
    //
    // Optional CLUT initialization for AL88 mode (16bpp)
    //
    if (_apColorConvAPI[LayerIndex] == GUICC_88666I) {
      for (i = 0; i < 256; i++) {
        _CLUT[i] = LCD_API_ColorConv_8666.pfIndex2Color(i);
      }
      HAL_LTDC_ConfigCLUT(&LTDC_Handle, _CLUT, 256, LayerIndex);
      HAL_LTDC_EnableCLUT(&LTDC_Handle, LayerIndex);
    }
  }
}

/*********************************************************************
*
*       _GetBufferSize
*/
static U32 _GetBufferSize(int LayerIndex) {
  U32 BufferSize;

  BufferSize = _axSize[LayerIndex] * _aySize[LayerIndex] * _aBytesPerPixels[LayerIndex];
  return BufferSize;
}

/*********************************************************************
*
*       _LCD_CopyBuffer
*/
static void _LCD_CopyBuffer(int LayerIndex, int IndexSrc, int IndexDst) {
  U32 BufferSize, AddrSrc, AddrDst;

  BufferSize = _GetBufferSize(LayerIndex);
  AddrSrc    = _aAddr[LayerIndex] + BufferSize * IndexSrc;
  AddrDst    = _aAddr[LayerIndex] + BufferSize * IndexDst;
  _DMA_Copy(LayerIndex, (void *)AddrSrc, (void *)AddrDst, _axSize[LayerIndex], _aySize[LayerIndex], 0, 0);
  _aBufferIndex[LayerIndex] = IndexDst; // After this function has been called all drawing operations are routed to Buffer[IndexDst]!
}

/*********************************************************************
*
*       _LCD_CopyRect
*/
static void _LCD_CopyRect(int LayerIndex, int x0, int y0, int x1, int y1, int xSize, int ySize) {
  U32 BufferSize, AddrSrc, AddrDst;
  int OffLine;

  BufferSize = _GetBufferSize(LayerIndex);
  AddrSrc = _aAddr[LayerIndex] + BufferSize * _aBufferIndex[LayerIndex] + (y0 * _axSize[LayerIndex] + x0) * _aBytesPerPixels[LayerIndex];
  AddrDst = _aAddr[LayerIndex] + BufferSize * _aBufferIndex[LayerIndex] + (y1 * _axSize[LayerIndex] + x1) * _aBytesPerPixels[LayerIndex];
  OffLine = _axSize[LayerIndex] - xSize;
  _DMA_Copy(LayerIndex, (void *)AddrSrc, (void *)AddrDst, xSize, ySize, OffLine, OffLine);
}

/*********************************************************************
*
*       _LCD_FillRect
*/
static void _LCD_FillRect(int LayerIndex, int x0, int y0, int x1, int y1, U32 PixelIndex) {
  U32 BufferSize, AddrDst;
  int xSize, ySize;

  if (GUI_GetDrawMode() == GUI_DM_XOR) {
    LCD_SetDevFunc(LayerIndex, LCD_DEVFUNC_FILLRECT, NULL);
    LCD_FillRect(x0, y0, x1, y1);
    LCD_SetDevFunc(LayerIndex, LCD_DEVFUNC_FILLRECT, (void(*)(void))_LCD_FillRect);
  } else {
    xSize = x1 - x0 + 1;
    ySize = y1 - y0 + 1;
    BufferSize = _GetBufferSize(LayerIndex);
    AddrDst = _aAddr[LayerIndex] + BufferSize * _aBufferIndex[LayerIndex] + (y0 * _axSize[LayerIndex] + x0) * _aBytesPerPixels[LayerIndex];
    _DMA_Fill(LayerIndex, (void *)AddrDst, xSize, ySize, _axSize[LayerIndex] - xSize, PixelIndex);
  }
}

/*********************************************************************
*
*       _LCD_DrawBitmap16bpp
*/
static void _LCD_DrawBitmap16bpp(int LayerIndex, int x, int y, U16 const * p, int xSize, int ySize, int BytesPerLine) {
  U32 BufferSize, AddrDst;
  int OffLineSrc, OffLineDst;

